index=* sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
| search powershell
| rex field=_raw "<Data Name='Image'>(?<Image>[^<]+)</Data>"
| rex field=_raw "<Data Name='CommandLine'>(?<CommandLine>[^<]+)</Data>"
| rex field=_raw "<Data Name='User'>(?<User>[^<]+)</Data>"
| table _time host User Image CommandLine
