index=* sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
EventID=1
(Image="*cmd.exe" OR Image="*powershell.exe" OR Image="*wmic.exe" OR Image="*psexec.exe")
| table _time host User Image CommandLine
